app/views/users/_form.html.erb

SELECT "roles".* FROM "roles" WHERE "roles"."id" IN (1, 3)
SELECT "roles".* FROM "roles"
---
  <% end %>
<% for role in Role.find(:all) %>
    <div>
      <%= check_box_tag "user[role_ids][]", role.id, @user.roles.include?(role) %>