app/views/users/show.html.erb

SELECT * FROM "roles" INNER JOIN "roles_users" ON "roles".id = "roles_users".role_id WHERE ("roles_users".user_id = 3 )
---
  <b>Rol:</b>
  <% @user.roles.each do |r| %>