app/controllers/communes_controller.rb

  def index
    @communes = Commune.all
---
SELECT "communes".* FROM "communes"

  def show
    @commune = Commune.find(params[:id])
---
SELECT "communes".* FROM "communes" WHERE "communes"."id" = 1 LIMIT 1