app/controllers/patients_controller.rb

  def create
    @patient = Patient.new(params[:patient])
    respond_to do |format|
      if @patient.save
---
INSERT INTO "patients" ("updated_at", "commune_id", "name", "village_id", "created_at") VALUES ('2011-04-30 11:47:24.452472', 1, 'Joselito II', 2, '2011-04-30 11:47:24.452472')

  def destroy
    @patient = Patient.find(params[:id])
    @patient.destroy
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = 9 LIMIT 1
DELETE FROM "patients" WHERE "patients"."id" = 9

  def update_village_select
      villages = Village.where(:commune_id => params[:id]).order(:name) unless params[:id].blank?
---
SELECT "villages".* FROM "villages" WHERE "villages"."commune_id" = 2 ORDER BY name