app/controllers/users_controller.rb

INSERT INTO "users" ("last_sign_in_at", "created_at", "current_sign_in_ip", "sign_in_count", "last_sign_in_ip", "encrypted_password", "current_sign_in_at", "username", "updated_at", "email", "reset_password_sent_at", "remember_created_at", "reset_password_token") VALUES (NULL, '2011-05-09 16:24:58.854948', NULL, 0, NULL, '$2a$10$.uhbzJDzG6c5g0tptHrwtOqtAG933WAza7K7.LRebAzO/YKhO6wKa', NULL, 'pepito', '2011-05-09 16:24:58.854948', 'pepito@gmail.com', NULL, NULL, NULL)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save