app/controllers/villages_controller.rb

  def index
    @villages = Village.all
---
SELECT "villages".* FROM "villages"

  def show
    @village = Village.find(params[:id])
---
SELECT "villages".* FROM "villages" WHERE "villages"."id" = 8 LIMIT 1

  def edit
    @village = Village.find(params[:id])
---
SELECT "villages".* FROM "villages" WHERE "villages"."id" = 2 LIMIT 1

  def create
    @village = Village.new(params[:village])

    respond_to do |format|
      if @village.save
---
INSERT INTO "villages" ("commune_id", "created_at", "name", "updated_at") VALUES (1, '2011-04-30 11:18:38.692395', 'pepe', '2011-04-30 11:18:38.692395')

  def destroy
    @village = Village.find(params[:id])
    @village.destroy
---
SELECT "villages".* FROM "villages" WHERE "villages"."id" = 8 LIMIT 1
DELETE FROM "villages" WHERE "villages"."id" = 8